#include <bits/stdc++.h> 
using namespace std; 
int V,E;
bool a[1001][1001];
void nhap(){
    memset(a,0,sizeof(a));
    cin >> V >> E;
	int x , y;
	for(int i = 0 ; i < E ; i++){
		cin >> x >> y;
		a[x-1][y-1]=1;
        a[y-1][x-1]=1;
	}
}
/*
sử dụng BFS và tô màu như bài 1
- Gán màu ĐỎ cho đỉnh ban đầu xét (put vào U)
- Tô màu tất cả các đỉnh lân cận bằng màu BLUE (put vào V)
- Tô màu tất cả lân cận của lân cận các đỉnh trên bằng màu ĐỎ (put vào U)
Tương tự đến hết
Nếu tìm thấy một đỉnh lân cận có màu giống với đỉnh hiện tại thì return false
*/
bool xuly1(int pos,int color[]){
    color[pos] = 1; 
    queue <int> q; 
    q.push(pos);
    while (!q.empty()) { 
        int u = q.front(); 
        q.pop();  
        if (a[u][u] == 1) 
            return false;   
        for (int v = 0; v < V; ++v) { 
            if (a[u][v] && color[v] == -1) {
                color[v] = 1 - color[u]; 
                q.push(v); 
            }  
            else if (a[u][v] && color[v] == color[u]) 
                return false; 
        } 
    } 
    return true;
}
bool xuly() { 
    int color[V]; 
    memset(color,-1,sizeof(color));
    for (int i = 0; i < V; i++){
        if (color[i] == -1) 
            if (xuly1( i, color ) == false) 
                return false; 
    } 
    return true;
     
} 
int main(){
	int t; cin >> t;
	while(t--){
	    nhap();
        if(xuly())
            cout<< "YES";
        else 
            cout << "NO"; 
        cout<<endl;
	}
    return 0;
}
/*
Trickstar Candina
                              _,add8ba,
                            ,d888888888b,
                           d8888888888888b                        _,ad8ba,_
                          d888888888888888)                     ,d888888888b,
                          I8888888888888888 _________          ,8888888888888b
                __________`Y88888888888888P"""""""""""baaa,__ ,888888888888888,
            ,adP"""""""""""9888888888P""^                 ^""Y8888888888888888I
         ,a8"^           ,d888P"888P^                           ^"Y8888888888P'
       ,a8^            ,d8888'                                     ^Y8888888P'
      a88'           ,d8888P'                                        I88P"^
    ,d88'           d88888P'                                          "b,
   ,d88'           d888888'                                            `b,
  ,d88'           d888888I                                              `b,
  d88I           ,8888888'            ___                                `b,
 ,888'           d8888888          ,d88888b,              ____            `b,
 d888           ,8888888I         d88888888b,           ,d8888b,           `b
,8888           I8888888I        d8888888888I          ,88888888b           8,
I8888           88888888b       d88888888888'          8888888888b          8I
d8886           888888888       Y888888888P'           Y8888888888,        ,8b
88888b          I88888888b      `Y8888888^             `Y888888888I        d88,
Y88888b         `888888888b,      `""""^                `Y8888888P'       d888I
`888888b         88888888888b,                           `Y8888P^        d88888
 Y888888b       ,8888888888888ba,_          _______        `""^        ,d888888
 I8888888b,    ,888888888888888888ba,_     d88888888b               ,ad8888888I
 `888888888b,  I8888888888888888888888b,    ^"Y888P"^      ____.,ad88888888888I
  88888888888b,`888888888888888888888888b,     ""      ad888888888888888888888'
  8888888888888698888888888888888888888888b_,ad88ba,_,d88888888888888888888888
  88888888888888888888888888888888888888888b,`"""^ d8888888888888888888888888I
  8888888888888888888888888888888888888888888baaad888888888888888888888888888'
  Y8888888888888888888888888888888888888888888888888888888888888888888888888P
  I888888888888888888888888888888888888888888888P^  ^Y8888888888888888888888'
  `Y88888888888888888P88888888888888888888888888'     ^88888888888888888888I
   `Y8888888888888888 `8888888888888888888888888       8888888888888888888P'
    `Y888888888888888  `888888888888888888888888,     ,888888888888888888P'
     `Y88888888888888b  `88888888888888888888888I     I888888888888888888'
       "Y8888888888888b  `8888888888888888888888I     I88888888888888888'
         "Y88888888888P   `888888888888888888888b     d8888888888888888'
            ^""""""""^     `Y88888888888888888888,    888888888888888P'
                             "8888888888888888888b,   Y888888888888P^
                              `Y888888888888888888b   `Y8888888P"^
                                "Y8888888888888888P     `""""^
                                  `"YY88888888888P'
                                       ^""""""""'
*/
